/* automatically generated by rust-bindgen 0.59.2 */

pub const SKP_USE_DOUBLE_PRECISION_FLOATS: u32 = 0;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 0;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 41;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __LDOUBLE_REDIRECTS_TO_FLOAT128_ABI: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT_C23: u32 = 0;
pub const __GLIBC_USE_IEC_60559_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT_C23: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __STATFS_MATCHES_STATFS64: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_TIME64_H: u32 = 1;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const _BITS_STDINT_LEAST_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const SKP_int32_MAX: u32 = 2147483647;
pub const SKP_int16_MAX: u32 = 32767;
pub const SKP_int8_MAX: u32 = 127;
pub const SKP_uint32_MAX: u32 = 4294967295;
pub const SKP_uint32_MIN: u32 = 0;
pub const SKP_uint16_MAX: u32 = 65535;
pub const SKP_uint16_MIN: u32 = 0;
pub const SKP_uint8_MAX: u32 = 255;
pub const SKP_uint8_MIN: u32 = 0;
pub const SKP_TRUE: u32 = 1;
pub const SKP_FALSE: u32 = 0;
pub const SKP_SILK_NO_ERROR: u32 = 0;
pub const SKP_SILK_ENC_INPUT_INVALID_NO_OF_SAMPLES: i32 = -1;
pub const SKP_SILK_ENC_FS_NOT_SUPPORTED: i32 = -2;
pub const SKP_SILK_ENC_PACKET_SIZE_NOT_SUPPORTED: i32 = -3;
pub const SKP_SILK_ENC_PAYLOAD_BUF_TOO_SHORT: i32 = -4;
pub const SKP_SILK_ENC_INVALID_LOSS_RATE: i32 = -5;
pub const SKP_SILK_ENC_INVALID_COMPLEXITY_SETTING: i32 = -6;
pub const SKP_SILK_ENC_INVALID_INBAND_FEC_SETTING: i32 = -7;
pub const SKP_SILK_ENC_INVALID_DTX_SETTING: i32 = -8;
pub const SKP_SILK_ENC_INTERNAL_ERROR: i32 = -9;
pub const SKP_SILK_DEC_INVALID_SAMPLING_FREQUENCY: i32 = -10;
pub const SKP_SILK_DEC_PAYLOAD_TOO_LARGE: i32 = -11;
pub const SKP_SILK_DEC_PAYLOAD_ERROR: i32 = -12;
pub const SILK_MAX_FRAMES_PER_PACKET: u32 = 5;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SKP_SILK_SDK_EncControlStruct {
    pub API_sampleRate: ::std::os::raw::c_int,
    pub maxInternalSampleRate: ::std::os::raw::c_int,
    pub packetSize: ::std::os::raw::c_int,
    pub bitRate: ::std::os::raw::c_int,
    pub packetLossPercentage: ::std::os::raw::c_int,
    pub complexity: ::std::os::raw::c_int,
    pub useInBandFEC: ::std::os::raw::c_int,
    pub useDTX: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SKP_SILK_SDK_EncControlStruct() {
    assert_eq!(
        ::std::mem::size_of::<SKP_SILK_SDK_EncControlStruct>(),
        32usize,
        concat!("Size of: ", stringify!(SKP_SILK_SDK_EncControlStruct))
    );
    assert_eq!(
        ::std::mem::align_of::<SKP_SILK_SDK_EncControlStruct>(),
        4usize,
        concat!("Alignment of ", stringify!(SKP_SILK_SDK_EncControlStruct))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).API_sampleRate as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(API_sampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).maxInternalSampleRate
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(maxInternalSampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).packetSize as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(packetSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).bitRate as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(bitRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).packetLossPercentage
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(packetLossPercentage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).complexity as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(complexity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).useInBandFEC as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(useInBandFEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_EncControlStruct>())).useDTX as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_EncControlStruct),
            "::",
            stringify!(useDTX)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SKP_SILK_SDK_DecControlStruct {
    pub API_sampleRate: ::std::os::raw::c_int,
    pub frameSize: ::std::os::raw::c_int,
    pub framesPerPacket: ::std::os::raw::c_int,
    pub moreInternalDecoderFrames: ::std::os::raw::c_int,
    pub inBandFECOffset: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SKP_SILK_SDK_DecControlStruct() {
    assert_eq!(
        ::std::mem::size_of::<SKP_SILK_SDK_DecControlStruct>(),
        20usize,
        concat!("Size of: ", stringify!(SKP_SILK_SDK_DecControlStruct))
    );
    assert_eq!(
        ::std::mem::align_of::<SKP_SILK_SDK_DecControlStruct>(),
        4usize,
        concat!("Alignment of ", stringify!(SKP_SILK_SDK_DecControlStruct))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_DecControlStruct>())).API_sampleRate as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_DecControlStruct),
            "::",
            stringify!(API_sampleRate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_DecControlStruct>())).frameSize as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_DecControlStruct),
            "::",
            stringify!(frameSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_DecControlStruct>())).framesPerPacket as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_DecControlStruct),
            "::",
            stringify!(framesPerPacket)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_DecControlStruct>())).moreInternalDecoderFrames
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_DecControlStruct),
            "::",
            stringify!(moreInternalDecoderFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_SILK_SDK_DecControlStruct>())).inBandFECOffset as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_SILK_SDK_DecControlStruct),
            "::",
            stringify!(inBandFECOffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SKP_Silk_TOC_struct {
    pub framesInPacket: ::std::os::raw::c_int,
    pub fs_kHz: ::std::os::raw::c_int,
    pub inbandLBRR: ::std::os::raw::c_int,
    pub corrupt: ::std::os::raw::c_int,
    pub vadFlags: [::std::os::raw::c_int; 5usize],
    pub sigtypeFlags: [::std::os::raw::c_int; 5usize],
}
#[test]
fn bindgen_test_layout_SKP_Silk_TOC_struct() {
    assert_eq!(
        ::std::mem::size_of::<SKP_Silk_TOC_struct>(),
        56usize,
        concat!("Size of: ", stringify!(SKP_Silk_TOC_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<SKP_Silk_TOC_struct>(),
        4usize,
        concat!("Alignment of ", stringify!(SKP_Silk_TOC_struct))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_Silk_TOC_struct>())).framesInPacket as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_Silk_TOC_struct),
            "::",
            stringify!(framesInPacket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SKP_Silk_TOC_struct>())).fs_kHz as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_Silk_TOC_struct),
            "::",
            stringify!(fs_kHz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SKP_Silk_TOC_struct>())).inbandLBRR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_Silk_TOC_struct),
            "::",
            stringify!(inbandLBRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SKP_Silk_TOC_struct>())).corrupt as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_Silk_TOC_struct),
            "::",
            stringify!(corrupt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SKP_Silk_TOC_struct>())).vadFlags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_Silk_TOC_struct),
            "::",
            stringify!(vadFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<SKP_Silk_TOC_struct>())).sigtypeFlags as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SKP_Silk_TOC_struct),
            "::",
            stringify!(sigtypeFlags)
        )
    );
}
extern "C" {
    pub fn SKP_Silk_SDK_Get_Encoder_Size(
        encSizeBytes: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_InitEncoder(
        encState: *mut ::std::os::raw::c_void,
        encStatus: *mut SKP_SILK_SDK_EncControlStruct,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_QueryEncoder(
        encState: *const ::std::os::raw::c_void,
        encStatus: *mut SKP_SILK_SDK_EncControlStruct,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_Encode(
        encState: *mut ::std::os::raw::c_void,
        encControl: *const SKP_SILK_SDK_EncControlStruct,
        samplesIn: *const ::std::os::raw::c_short,
        nSamplesIn: ::std::os::raw::c_int,
        outData: *mut ::std::os::raw::c_uchar,
        nBytesOut: *mut ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_Get_Decoder_Size(
        decSizeBytes: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_InitDecoder(decState: *mut ::std::os::raw::c_void)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_Decode(
        decState: *mut ::std::os::raw::c_void,
        decControl: *mut SKP_SILK_SDK_DecControlStruct,
        lostFlag: ::std::os::raw::c_int,
        inData: *const ::std::os::raw::c_uchar,
        nBytesIn: ::std::os::raw::c_int,
        samplesOut: *mut ::std::os::raw::c_short,
        nSamplesOut: *mut ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SKP_Silk_SDK_search_for_LBRR(
        inData: *const ::std::os::raw::c_uchar,
        nBytesIn: ::std::os::raw::c_int,
        lost_offset: ::std::os::raw::c_int,
        LBRRData: *mut ::std::os::raw::c_uchar,
        nLBRRBytes: *mut ::std::os::raw::c_short,
    );
}
extern "C" {
    pub fn SKP_Silk_SDK_get_TOC(
        inData: *const ::std::os::raw::c_uchar,
        nBytesIn: ::std::os::raw::c_int,
        Silk_TOC: *mut SKP_Silk_TOC_struct,
    );
}
extern "C" {
    pub fn SKP_Silk_SDK_get_version() -> *const ::std::os::raw::c_char;
}
